Thanks for the contribution. Can you please provide more details? I cannot reproduce:

```
$ terraform apply
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - drakkan/sftpgo in /home/nicola/go/bin
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become
│ incompatible with published releases.
╵

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # sftpgo_user.test will be created
  + resource "sftpgo_user" "test" {
      + created_at                  = (known after apply)
      + email                       = "test@test.com"
      + filesystem                  = {
          + azblobconfig = {
              + account_key  = (sensitive value)
              + account_name = "name"
              + container    = "container"
            }
          + provider     = 3
        }
      + filters                     = (known after apply)
      + first_download              = (known after apply)
      + first_upload                = (known after apply)
      + home_dir                    = "/tmp/test1"
      + id                          = (known after apply)
      + last_login                  = (known after apply)
      + last_password_change        = (known after apply)
      + last_quota_update           = (known after apply)
      + password                    = (sensitive value)
      + permissions                 = {
          + "/" = "*"
        }
      + status                      = 1
      + updated_at                  = (known after apply)
      + used_download_data_transfer = (known after apply)
      + used_quota_files            = (known after apply)
      + used_quota_size             = (known after apply)
      + used_upload_data_transfer   = (known after apply)
      + username                    = "test"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + sftpgo_user = (sensitive value)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

sftpgo_user.test: Creating...
sftpgo_user.test: Creation complete after 0s [id=test]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

sftpgo_user = <sensitive>
nicola@p16s /tmp/user $ terraform plan
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - drakkan/sftpgo in /home/nicola/go/bin
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become
│ incompatible with published releases.
╵
sftpgo_user.test: Refreshing state... [id=test]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```